tutorials/Aerodynamics/NACA0012_Airfoil_Compressible/run/system/adjointDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      adjointDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

flowOptions
{
    flowCondition          Compressible;
    setFlowBCs             false;
    flowBCs                { useWallFunction true; bc0 {patch inout; variable U; value (242.6540245 13.5508078782 0);} }
    inletPatches           (inout);
    outletPatches          (inout);
    derivUInInfo           {stateName U; component 0; type fixedValue;patchNames (inlet ); }
    userDefinedPatchInfo   { }
    userDefinedVolumeInfo  { }
    referenceValues        (ARef 1.000000e-01 magURef 2.430321e+02 pRef 1.013250e+05 rhoRef 1.176829e+00 LRef 1.000000e+00 );
    divDev2                true;
    useNKSolver            false;
    nkSegregatedTurb       false;
    nkSegregatedPhi        false;
    nkRelTol               1.000000e-08;
    nkAbsTol               1.000000e-12;
    nkSTol                 1.000000e-08;
    nkEWRTol0              0.300000;
    nkEWRTolMax            0.700000;
    nkPCLag                1;
    nkMaxIters             100;
    nkMaxFuncEvals         10000;
    nkASMOverlap           1;
    nkGlobalPCIters        0;
    nkLocalPCIters         1;
    nkPCFillLevel          0;
    nkJacMatReOrdering     rcm;
    nkGMRESMaxIters        500;
    nkGMRESRestart         500;
}

adjointOptions
{
    solveAdjoint           true;
    useColoring            true;
    normalizeResiduals     (URes pRes eRes nuTildaRes TRes phiRes kRes omegaRes epsilonRes);
    normalizeStates        (U p e nuTilda T phi k epsilon omega);
    nFFDPoints             41;
    correctWallDist        true;
    reduceResCon4JacMat    false;
    calcPCMat              true;
    fastPCMat              false;
    delTurbProd4PCMat      false;
    writeMatrices          false;
    adjGMRESMaxIters       2000;
    adjGMRESRestart        2000;
    adjASMOverlap          1;
    adjJacMatOrdering      cell;
    adjJacMatReOrdering    natural;
    adjGlobalPCIters       0;
    adjLocalPCIters        1;
    adjPCFillLevel         2;
    adjGMRESRelTol         1.000000e-06;
    adjGMRESAbsTol         1.000000e-16;
    minTolJac              1.000000e-14;
    maxTolJac              1.000000e+14;
    minTolPC               1.000000e-14;
    maxTolPC               1.000000e+14;
    stateResetTol          1.000000e-06;
    tractionBCMaxIter      20;
    epsDeriv               1.000000e-06;
    epsDerivFFD            1.000000e-03;
    epsDerivXv             1.000000e-07;
    epsDerivUIn            1.000000e-05;
    epsDerivVis            1.000000e-08;
    stateScaling           ( UScaling 243.032096646 nuTildaScaling 0.0001 kScaling 0.1 TScaling 300.0 epsilonScaling 100.0 omegaScaling 1000 phiScaling 1 pScaling 101325.0);
    residualScaling        ();
    maxResConLv4JacPCMat   ( URes 2 kRes 2 epsilonRes 2 eRes 2 omegaRes 2 TRes 2 phiRes 2 nuTildaRes 2 pRes 3);
    adjDVTypes             (FFD);
}

actuatorDiskOptions
{
    actuatorActive         0;
    actuatorAdjustThrust   0;
    actuatorVolumeNames    ();
    actuatorThrustCoeff    ();
    actuatorPOverD         ();
    actuatorRotationDir    ();
}

objectiveFunctionOptions
{
    objFuncs               (CD CL);
    objFuncGeoInfo         (  (wing wingte)  (wing wingte) );
    dragDir                (0.9984443530 0.0557572768 0.0000000000 );
    liftDir                (-0.0557572768 0.9984443530 0.0000000000 );
    CofR                   (0.2500000000 0.0000000000 0.0000000000 );
    rotRad                 (0.0000000000 0.0000000000 0.0000000000 );
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
