tutorials/Aerodynamics/NACA0012_Airfoil_Compressible/run/system/controlDict
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs
(
    "libbuoyantPressureFvPatchScalarField.so" 
    "libDummyTurbulenceModelCompressible.so" 
    "libSpalartAllmarasFv3Compressible.so" 
);

application     rhoSimpleCDAFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         1000;
deltaT          1;
writeControl    timeStep;
writeInterval   1000;
purgeWrite      0;
writeFormat     ascii;
writePrecision  16;
writeCompression on;
timeFormat      general;
timePrecision   16;
runTimeModifiable true;

functions
{ 
    forceCoeffs
    { 
        type                forceCoeffs;
        libs                ("libforces.so");
        writeControl        timeStep;
        timeInterval        1;
        log                 yes;
        patches             (wing wingte);
        pName               p;
        UName               U;
        rho                 rhoInf;
        rhoInf              1.176829;
        dragDir             (0.9984443530 0.0557572768 0.0000000000);
        liftDir             (-0.0557572768 0.9984443530 0.0000000000);
        CofR                (0.250000 0.000000 0.000000);
        pitchAxis           (0 1 0);
        magUInf             243.032097;
        lRef                1.000000;
        Aref                0.100000;
    } 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
